#include <stdio.h>
#include <stdlib.h>

int main()
{    
   int i,j,sum,max=0,no=1;
   int sale[][6]={{112,76,95,120,98,68},
                   {90,120,88,112,108,120},
                   {108,99,126,90,76,98}};/* 省略第一維的索引值不填 */ 
   
   printf("***** 數位資訊公司業務統計表 *****\n"); 
   printf("-----------------------------------\n");
   for(i=0;i<3;i++)
   {
      sum=0;
      for(j=0;j<6;j++)
       sum+=sale[i][j];/* 計算每個業務員半年的業績金額 */ 
      printf("銷售員%d的前半年銷售總金額為 %d\n",i+1,sum); 
      printf("-----------------------------------\n");  
   }
   printf("\n\n");
     for(i=0;i<6;i++)
   {
      sum=0;
      for(j=0;j<3;j++)
       sum+=sale[j][i];/* 每月三個業務員的業績金額 */ 
      printf("三個業務員%d月的銷售總金額為 %d\n",i+1,sum); 
      printf("===================================\n");  
   }  
   
   system("pause");
   return 0;
}


